Revit 2024 API
LineProperties Members
The LineProperties type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the LineProperties
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Color
 The current color used when drawing lines/curves.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
LineWidth
 The current width (thickness) of the pen stroke when drawing lines/curves.
PatternId
 Id of the current Line pattern element used when drawing lines/curves.
Transparency
 The current transparency level to be applied to the current color.
See Also
LineProperties Class
Autodesk.Revit.DB Namespace